In [1]:
from datascience import *
import numpy as np
import math as m
import IPython.display

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

# Drinks

In [2]:
drinks = Table(['Drink', 'Cafe', 'Price']).with_rows([
    ['Milk Tea', 'Tea One', 4],
    ['Espresso', 'Nefeli', 2],
    ['Coffee', 'Nefeli', 3],
    ['Espresso', "Abe's", 2]
])
discounts = Table().with_columns(
    'Coupons % off', make_array(5, 50, 25),
    'Location', make_array('Tea One', 'Nefeli', 'Tea One')
)
a = drinks.join('Cafe', discounts, 'Location')
a = a.with_column('Discounted Price', a.column(2) * (1 - a.column(3)/100) )
a = a.drop(2, 3)
a

Cafe    | Drink    | Discounted Price
Nefeli  | Espresso | 1
Nefeli  | Coffee   | 1.5
Tea One | Milk Tea | 3.8
Tea One | Milk Tea | 3

In [3]:
a.sort('Discounted Price').sort('Cafe', distinct=True)

Cafe    | Drink    | Discounted Price
Nefeli  | Espresso | 1
Tea One | Milk Tea | 3

<br><br><br><br><br>

## Bike system

In [4]:
trip = Table.read_table('db/2017-fordgobike-tripdata.csv').select(4, 8, 0).relabeled(0, 'Start').relabeled(1, 'End').relabeled(2, 'Duration').where('Duration', are.below(1800))
trip.show(3)

In [5]:
## The name of the station where the most rentals ended (assume no ties)
trip.group('End').sort('count', descending=True).column(0).item(0)

'San Francisco Caltrain (Townsend St at 4th St)'

In [6]:
## The number of the stations for which the average duration ending at the station was more than 10 minutes.
trip.group('End', np.average).where(2, are.above(10 * 60)).num_rows

180

<br><br><br><br><br>

## Advanced where

In [7]:
3 > 2

True

In [8]:
1 > 2

False

In [9]:
np.arange(5) > 2

array([False, False, False,  True,  True])

In [10]:
full_census_table = Table.read_table('http://www2.census.gov/programs-surveys/popest/datasets/2010-2015/national/asrh/nc-est2015-agesex-res.csv')
partial = full_census_table.select('SEX', 'AGE', 'POPESTIMATE2010', 'POPESTIMATE2015')
us_pop = partial.relabeled(2, '2010').relabeled(3, '2015')
us_pop

SEX  | AGE  | 2010    | 2015
0    | 0    | 3951330 | 3978038
0    | 1    | 3957888 | 3968564
0    | 2    | 4090862 | 3966583
0    | 3    | 4111920 | 3974061
0    | 4    | 4077551 | 4020035
0    | 5    | 4064653 | 4018158
0    | 6    | 4073013 | 4019207
0    | 7    | 4043046 | 4148360
0    | 8    | 4025604 | 4167887
0    | 9    | 4125415 | 4133564
... (296 rows omitted)

In [11]:
us_pop.where('AGE', 70)

SEX  | AGE  | 2010    | 2015
0    | 70   | 2062577 | 2492490
1    | 70   | 954073  | 1162672
2    | 70   | 1108504 | 1329818

In [12]:
us_pop.where('AGE', 70).where([False, True, True])

SEX  | AGE  | 2010    | 2015
1    | 70   | 954073  | 1162672
2    | 70   | 1108504 | 1329818

In [13]:
seventy = us_pop.where('AGE', 70)
seventy.column('2010') < 2000000

array([False,  True,  True])

In [14]:
seventy.where(seventy.column('2010') < 2000000)

SEX  | AGE  | 2010    | 2015
1    | 70   | 954073  | 1162672
2    | 70   | 1108504 | 1329818

In [15]:
us_pop.column('2015') / us_pop.column('2010') > 1.5

array([False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False,  True,  True,
       False,  True,  True,  True,  True, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False,
       False, False, False, False, False, False, False, False, False])

In [16]:
us_pop.where(us_pop.column('2015') / us_pop.column('2010') > 1.5)

SEX  | AGE  | 2010  | 2015
1    | 94   | 43827 | 68135
1    | 95   | 31736 | 48015
1    | 97   | 14775 | 23092
1    | 98   | 9505  | 14719
1    | 99   | 6104  | 9577
1    | 100  | 9352  | 15088

In [17]:
trip.show(3)

In [18]:
# The average duration of all trips
np.average(trip.column('Duration'))

644.1682466120404

In [19]:
# The average duration of trips that started and ended at the same station
np.average(trip.where(trip.column('Start') == trip.column('End')).column('Duration'))

794.959852086635

In [20]:
# The average duration of trips that started and ended at different stations
np.average(trip.where(trip.column('Start') != trip.column('End')).column('Duration'))

641.1591353279626